app/controllers/post_controller.rb

SELECT "posts".* FROM "posts" ORDER BY id DESC
---
  def index
    @posts = Post.all.order('id DESC')

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 9]]
---
  def destroy
    @post = Post.find_by(id: params[:id])
    if @post.destroy

INSERT INTO "posts" ("user_id", "contents", "post_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 11], ["contents", "テスト　画像"], ["post_image", ".jpg"], ["created_at", "2017-11-21 08:02:31.343403"], ["updated_at", "2017-11-21 08:02:31.343403"]]
---
  def new_post
    @post = Post.new(
      user_id: @current_user.id,
      contents: params[:post_content]
    )
    if @post.save