app/controllers/user_controller.rb

  def signup
    @user = User.new(
      name: params[:name],
      email: params[:email],
      password: params[:password],
      image_name: "default_user.jpg")
    key_user = User.find_by(id:1)
    if key_user.authenticate(params[:keyword])
      if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "password_digest", "image_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    if params[:image]
      image = params[:image]
      @user.image_name = "#{@user.id}.jpg"
      File.binwrite("public/user_image/#{@user.image_name}", image.read)
    end
    if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "3.jpg"], ["updated_at", "2017-11-13 08:26:19.906034"], ["id", 3]]

  def pass_change
    @user = User.find_by(id: params[:id])
    if @user.authenticate(params[:former_password])
      @user.password = params[:new_password]
      if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$EDnToRrTT31CwlFQ9TjoLO7eLCD3gNILN52yTodlE2KSPBEIR87Q."], ["updated_at", "2017-11-15 02:32:07.955237"], ["id", 3]]

  def destroy
    @user = User.find_by(id: params[:id])
    if @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 8]]